In [21]:
import pandas as pd
import numpy as np

In [36]:
from numpy.random import randn
df = pd.DataFrame(randn(6,5))
df

          0         1         2         3         4
0  0.936806 -1.452849  1.741717  0.823227 -0.723457
1 -0.339000  1.213192 -0.726898  0.270291  1.381437
2  0.353481  0.469215  0.924276  0.614162 -0.202675
3  0.487188 -0.887014 -0.205525  0.919636  0.396241
4 -0.794613  0.265683  0.277890  0.232709  0.901575
5 -1.055073 -0.397801  0.752747 -0.526550  0.069214

In [37]:
df.loc['new']=[1,2,3,4,5]
df

            0         1         2         3         4
0    0.936806 -1.452849  1.741717  0.823227 -0.723457
1   -0.339000  1.213192 -0.726898  0.270291  1.381437
2    0.353481  0.469215  0.924276  0.614162 -0.202675
3    0.487188 -0.887014 -0.205525  0.919636  0.396241
4   -0.794613  0.265683  0.277890  0.232709  0.901575
5   -1.055073 -0.397801  0.752747 -0.526550  0.069214
new  1.000000  2.000000  3.000000  4.000000  5.000000

In [38]:
df['baru'] = df[0] + df[1]
df

            0         1         2         3         4      baru
0    0.936806 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1   -0.339000  1.213192 -0.726898  0.270291  1.381437  0.874192
2    0.353481  0.469215  0.924276  0.614162 -0.202675  0.822696
3    0.487188 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4   -0.794613  0.265683  0.277890  0.232709  0.901575 -0.528930
5   -1.055073 -0.397801  0.752747 -0.526550  0.069214 -1.452873
new  1.000000  2.000000  3.000000  4.000000  5.000000  3.000000

In [39]:
df.insert(1,'new',[1,2,3,4,5,6,7])

In [40]:
df

            0  new         1         2         3         4      baru
0    0.936806    1 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1   -0.339000    2  1.213192 -0.726898  0.270291  1.381437  0.874192
2    0.353481    3  0.469215  0.924276  0.614162 -0.202675  0.822696
3    0.487188    4 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4   -0.794613    5  0.265683  0.277890  0.232709  0.901575 -0.528930
5   -1.055073    6 -0.397801  0.752747 -0.526550  0.069214 -1.452873
new  1.000000    7  2.000000  3.000000  4.000000  5.000000  3.000000

In [41]:
df.drop('new',axis=1)

            0         1         2         3         4      baru
0    0.936806 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1   -0.339000  1.213192 -0.726898  0.270291  1.381437  0.874192
2    0.353481  0.469215  0.924276  0.614162 -0.202675  0.822696
3    0.487188 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4   -0.794613  0.265683  0.277890  0.232709  0.901575 -0.528930
5   -1.055073 -0.397801  0.752747 -0.526550  0.069214 -1.452873
new  1.000000  2.000000  3.000000  4.000000  5.000000  3.000000

In [42]:
df

            0  new         1         2         3         4      baru
0    0.936806    1 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1   -0.339000    2  1.213192 -0.726898  0.270291  1.381437  0.874192
2    0.353481    3  0.469215  0.924276  0.614162 -0.202675  0.822696
3    0.487188    4 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4   -0.794613    5  0.265683  0.277890  0.232709  0.901575 -0.528930
5   -1.055073    6 -0.397801  0.752747 -0.526550  0.069214 -1.452873
new  1.000000    7  2.000000  3.000000  4.000000  5.000000  3.000000

In [43]:
df.drop('new',axis=1,inplace=True)

In [44]:
df

            0         1         2         3         4      baru
0    0.936806 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1   -0.339000  1.213192 -0.726898  0.270291  1.381437  0.874192
2    0.353481  0.469215  0.924276  0.614162 -0.202675  0.822696
3    0.487188 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4   -0.794613  0.265683  0.277890  0.232709  0.901575 -0.528930
5   -1.055073 -0.397801  0.752747 -0.526550  0.069214 -1.452873
new  1.000000  2.000000  3.000000  4.000000  5.000000  3.000000

In [47]:
df.drop('new',axis=0)

          0         1         2         3         4      baru
0  0.936806 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1 -0.339000  1.213192 -0.726898  0.270291  1.381437  0.874192
2  0.353481  0.469215  0.924276  0.614162 -0.202675  0.822696
3  0.487188 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4 -0.794613  0.265683  0.277890  0.232709  0.901575 -0.528930
5 -1.055073 -0.397801  0.752747 -0.526550  0.069214 -1.452873

In [48]:
df

            0         1         2         3         4      baru
0    0.936806 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1   -0.339000  1.213192 -0.726898  0.270291  1.381437  0.874192
2    0.353481  0.469215  0.924276  0.614162 -0.202675  0.822696
3    0.487188 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4   -0.794613  0.265683  0.277890  0.232709  0.901575 -0.528930
5   -1.055073 -0.397801  0.752747 -0.526550  0.069214 -1.452873
new  1.000000  2.000000  3.000000  4.000000  5.000000  3.000000

In [49]:
df.reset_index()

  index         0         1         2         3         4      baru
0     0  0.936806 -1.452849  1.741717  0.823227 -0.723457 -0.516043
1     1 -0.339000  1.213192 -0.726898  0.270291  1.381437  0.874192
2     2  0.353481  0.469215  0.924276  0.614162 -0.202675  0.822696
3     3  0.487188 -0.887014 -0.205525  0.919636  0.396241 -0.399826
4     4 -0.794613  0.265683  0.277890  0.232709  0.901575 -0.528930
5     5 -1.055073 -0.397801  0.752747 -0.526550  0.069214 -1.452873
6   new  1.000000  2.000000  3.000000  4.000000  5.000000  3.000000

In [56]:
newind = 'aa bb cc dd ee ff gg'.split()
newind

['aa', 'bb', 'cc', 'dd', 'ee', 'ff', 'gg']

In [57]:
df['baru'] = newind

In [58]:
df

            0         1         2         3         4 baru
0    0.936806 -1.452849  1.741717  0.823227 -0.723457   aa
1   -0.339000  1.213192 -0.726898  0.270291  1.381437   bb
2    0.353481  0.469215  0.924276  0.614162 -0.202675   cc
3    0.487188 -0.887014 -0.205525  0.919636  0.396241   dd
4   -0.794613  0.265683  0.277890  0.232709  0.901575   ee
5   -1.055073 -0.397801  0.752747 -0.526550  0.069214   ff
new  1.000000  2.000000  3.000000  4.000000  5.000000   gg

In [59]:
df.set_index('baru')

             0         1         2         3         4
baru
aa    0.936806 -1.452849  1.741717  0.823227 -0.723457
bb   -0.339000  1.213192 -0.726898  0.270291  1.381437
cc    0.353481  0.469215  0.924276  0.614162 -0.202675
dd    0.487188 -0.887014 -0.205525  0.919636  0.396241
ee   -0.794613  0.265683  0.277890  0.232709  0.901575
ff   -1.055073 -0.397801  0.752747 -0.526550  0.069214
gg    1.000000  2.000000  3.000000  4.000000  5.000000

In [60]:
df

            0         1         2         3         4 baru
0    0.936806 -1.452849  1.741717  0.823227 -0.723457   aa
1   -0.339000  1.213192 -0.726898  0.270291  1.381437   bb
2    0.353481  0.469215  0.924276  0.614162 -0.202675   cc
3    0.487188 -0.887014 -0.205525  0.919636  0.396241   dd
4   -0.794613  0.265683  0.277890  0.232709  0.901575   ee
5   -1.055073 -0.397801  0.752747 -0.526550  0.069214   ff
new  1.000000  2.000000  3.000000  4.000000  5.000000   gg

In [61]:
df.set_index('baru',inplace=True)

In [62]:
df

             0         1         2         3         4
baru
aa    0.936806 -1.452849  1.741717  0.823227 -0.723457
bb   -0.339000  1.213192 -0.726898  0.270291  1.381437
cc    0.353481  0.469215  0.924276  0.614162 -0.202675
dd    0.487188 -0.887014 -0.205525  0.919636  0.396241
ee   -0.794613  0.265683  0.277890  0.232709  0.901575
ff   -1.055073 -0.397801  0.752747 -0.526550  0.069214
gg    1.000000  2.000000  3.000000  4.000000  5.000000